public/Tipos/HoTT/HoTT/transitividad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-21 Sun 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Transitividad</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/style.css' />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
        <div class="navbar-brand">
            <a href="/index.html">🏠 Home</a>
        </div>
        <div class="navbar-menu">
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🖥️ Computación</a>
                        <div class="dropdown-content">
                                <a href="/Computacion/index.html">📋 Resumen</a>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">⚙️ Algoritmos</a>
                                        <div class="submenu-content">
                                                <a href="/Computacion/Algoritmos/index.html">📋 Resumen</a>
                                                <a href="/Computacion/Algoritmos/pensamiento.html">🧠 Pensamiento algorítmico</a>
                                        </div>
                                </div>
                        </div>
                </div>
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🤖 AI</a>
                        <div class="dropdown-content">
                                <a href="/AI/index.html">📋 Resumen</a>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">📚 CS229</a>
                                        <div class="submenu-content">
                                                <a href="/AI/CS229/index.html">📋 Resumen</a>
                                                <a href="/AI/CS229/AprendizajeSupervisado/aprendizaje_supervisado.html">🎯 Aprendizaje Supervisado</a>
                                                <a href="/AI/CS229/AprendizajeSupervisado/regresion_lineal.html">📈 Regresión Lineal</a>
                                        </div>
                                </div>
                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🏗️ DataCamp</a>
                                        <div class="submenu-content">
                                                <a href="/AI/DataCamp/index.html">📋 Resumen</a>
                                                <a href="/AI/DataCamp/desglosando_el_transformer.html">🔍 Desglosando el Transformer</a>
                                                <a href="/AI/DataCamp/embedding_y_codificacion_posicional.html">🔗 Embedding y Codificación Posicional</a>
                                        </div>
                                </div>
                        </div>
                </div>
                <div class="navbar-item dropdown">
                        <a href="#" class="dropbtn">🔤 Tipos</a>
                        <div class="dropdown-content">

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">✍️ Pruebas y tipos</a>
                                        <div class="submenu-content">
                                                <a href="/Tipos/ProofsAndTypes/index.html">📋 Resumen </a>
                                                <a href="/Tipos/ProofsAndTypes/sentido.html">🧠 Sentido, denotación y semántica</a>
                                        </div>
                                </div>

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🔬 HoTT</a>
                                        <div class="submenu-content">
                                                <div class="dropdown-submenu">
                                                        <a href="#" class="submenu-btn">🔬 HoTT (Carnegie Mellon)</a>
                                                        <div class="submenu-content">
                                                                <a href="/HoTT/index.html">📋 Resumen</a>
                                                                <a href="/HoTT/introduccion.html">🚀 Introducción</a>
                                                                <a href="/HoTT/juicios.html">⚖️ Juicios</a>
                                                                <a href="/HoTT/transitividad.html">🔛 Transitividad </a>
                                                                <a href="/HoTT/exponenciales.html">🗼 Exponenciales</a>
                                                                <a href="/HoTT/igualdad.html">🟰 Igualdad</a>
                                                        </div>
                                                </div>

                                                <div class="dropdown-submenu">
                                                        <a href="#" class="submenu-btn">🔬 Introducción a HoTT (Rijke)</a>
                                                        <div class="submenu-content">
                                                                <a href="/Tipos/Rijke/index.html">📋 Resumen </a>
                                                        </div>
                                                </div>
                                        </div>
                                </div>

                                <div class="dropdown-submenu">
                                        <a href="#" class="submenu-btn">🖥️ Lean</a>
                                        <div class="submenu-content">
                                                <a href="/Tipos/Lean/index.html">📋 Resumen </a>
                                        </div>
                                </div>
                        </div>
                </div>
        </div>
  </nav>
</div>
<div id="content" class="content">
<h1 class="title">Transitividad</h1>
<div id="outline-container-orgfd8ec4f" class="outline-2">
<h2 id="orgfd8ec4f">Álgebras de Heyting</h2>
<div class="outline-text-2" id="text-orgfd8ec4f">
<p>
Un álgebra de Heyting es una retícula (pre-orden con todos los "meets" y "joins" finitos,
es decir, máximas cotas inferiores y mínimas cotas superiores) que tiene exponenciales.
</p>

<p>
En un álgebra de Heyting podemos definir la negación de \(A\) como
\[ \lnot A := A \supset \bot = \bot^A \]
Es decir, la \(C\) más grande que es inconsistente con \(A\).
</p>
</div>
<div id="outline-container-org7083193" class="outline-3">
<h3 id="org7083193">Observaciones</h3>
<div class="outline-text-3" id="text-org7083193">
<ul class="org-ul">
<li>Toda álgebra de Heyting es distributiva.</li>
<li>Toda álgebra Booleana tiene exponenciales
\[
                B^A := \lnot A \lor B
        \]</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb150c38" class="outline-2">
<h2 id="orgb150c38">Álgebras Booleana</h2>
<div class="outline-text-2" id="text-orgb150c38">
<p>
Un álgebra Booleana es una retícula complementada (\(\overline{A}\) es la \(C\) más pequeña
tal que \(A \lor C \geq \top\)) y distributiva.
</p>
</div>
<div id="outline-container-org0e6401d" class="outline-3">
<h3 id="org0e6401d">Afirmación</h3>
<div class="outline-text-3" id="text-org0e6401d">
<p>
<em> En la lógica intuicionista no todas las instancias del tercio excluso son
demostrables </em> <br>
En general, no podemos esperar que para cada \( A \) que \( A \lor \lnot A ~ True \).
</p>
</div>
<div id="outline-container-orgfa99f93" class="outline-4">
<h4 id="orgfa99f93">Idea (Propiedad de la disyunción) </b> <br></h4>
<div class="outline-text-4" id="text-orgfa99f93">
<p>
Si podemos mostrar que \( A \lor B ~ True\) entonces podemos mostrar \(A ~ True\) o
\(B ~ True\).
</p>
</div>
</div>
</div>
<div id="outline-container-org45a1d67" class="outline-3">
<h3 id="org45a1d67">Afirmación (Continuación)</h3>
<div class="outline-text-3" id="text-org45a1d67">
<p>
Por lo tanto, si eso fuera cierto, para cada \(A\) tendríamos \(A ~ True\) o
\(A ~ False\), lo cual es refutable. Basta pensar en un problema abierto de la matemática.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc05aa40" class="outline-2">
<h2 id="orgc05aa40">IPL (Lógica Proposicional Intuicionista) desde la teoría de la demostración</h2>
<div class="outline-text-2" id="text-orgc05aa40">
</div>
<div id="outline-container-org64b334f" class="outline-4">
<h4 id="org64b334f">Afirmación</h4>
<div class="outline-text-4" id="text-org64b334f">
<p>
En la lógica proposicional intuicionista, no todas las instancias de la ley del tercio excluso son
demostrables, es decir, no es cierto que para cada \(A\), \(A \lor \lnot A ~ True\).
</p>

<p>
La idea de porqué esto no es cierto es la propiedad de la disyunción, que dice que si
queremos mostrar que \(A \lor B ~ True\) entonces debemos probar que \(A~ True\) o \(B ~ True\).
Aplicando esta idea a nuestro caso, vemos que para mostrar \(A \lor \lnot A ~ True\) deberíamos de ser capaces de
dar una prueba o una refutación de \(A\), lo cual no siempre sucede, basta pensar en algún problema abierto.
</p>
</div>
</div>
<div id="outline-container-orgc127a7f" class="outline-4">
<h4 id="orgc127a7f">Definición</h4>
<div class="outline-text-4" id="text-orgc127a7f">
<p>
\(A ~ Prop\) es decidible si \(A \lor \lnot A ~ True\)
</p>
</div>
<div id="outline-container-org11fe1c0" class="outline-5">
<h5 id="org11fe1c0">Ejemplos</h5>
<div class="outline-text-5" id="text-org11fe1c0">
<ul class="org-ul">
<li>Si \(A = \top\), entonces \(A\) es decidible.</li>
<li>Si \(A = \bot\), entonces \(A\) es decidible.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd94281b" class="outline-4">
<h4 id="orgd94281b">Definición</h4>
<div class="outline-text-4" id="text-orgd94281b">
<p>
\(A ~ Prop\) es estable si y sólo si \(\lnot(\lnot A) \supset \top ~ True\)
</p>
</div>
</div>
<div id="outline-container-org1deeeaf" class="outline-4">
<h4 id="org1deeeaf">Afirmación</h4>
<div class="outline-text-4" id="text-org1deeeaf">
<p>
Para cada \(A\), \(\lnot (\lnot (A \lor \lnot A))\), es decir, la ley del tercio excluso no es refutable.
</p>
</div>
<div id="outline-container-orga671cf9" class="outline-5">
<h5 id="orga671cf9">Demostración</h5>
<div class="outline-text-5" id="text-orga671cf9">
<p>
Supongamos, en busca de una contradicción, que \(\lnot(A\lor\lnot A)\).
Es suficiente probar \(A \lor \lnot A\) y, para esto, es suficiente que probemos \(\lnot A\).
Para probar esto, supongamos \(A\), entonces \(A \lor \lnot A\), lo cual es una contradicción que lo que habíamos
supuesto.
</p>
</div>
</div>
</div>
<div id="outline-container-org6a54c2c" class="outline-4">
<h4 id="org6a54c2c">Corolario</h4>
<div class="outline-text-4" id="text-org6a54c2c">
<p>
No toda proposición es estable.
</p>
</div>
</div>
<div id="outline-container-org8fa7d78" class="outline-3">
<h3 id="org8fa7d78">¿Cómo probamos la propiedad de la disyunción en IPL?</h3>
<div class="outline-text-3" id="text-org8fa7d78">
<p>
Interpretamos las reglas que habíamos dado de IPL como una definición inductiva de la implicación lógica.
</p>
</div>
<div id="outline-container-orgdcd76b0" class="outline-4">
<h4 id="orgdcd76b0">Teorema</h4>
<div class="outline-text-4" id="text-orgdcd76b0">
<p>
Si \( \emptyset \vdash A \lor B ~ True\), entonces \(\emptyset \vdash A ~ True\) o \(\emptyset \vdash B ~ True\).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org11873ec" class="outline-2">
<h2 id="org11873ec">La idea de Gentzen (principio de inversión)</h2>
<div class="outline-text-2" id="text-org11873ec">
<p>
<code>elim</code> es post-inverso a <code>intro</code>.
</p>
</div>
</div>
</div>
</body>
</html>
